import pymongo

facs = [
    "ІАТ", "ІАТЕ", "ІЕЕ",
    "ІМЗ", "ІПСА", "ІТС",
    "ММІ", "ФТІ", "ІХФ",
    "ПБФ", "РТФ", "ФБМІ",
    "ФБТ", "ФЕА", "ФЕЛ",
    "ФІОТ", "ФЛ", "ФММ",
    "ФМФ", "ФПМ", "ФСП",
    "ХТФ", "ІСЗЗІ",
]

kpi_awards = [
    "Грамота Вченої ради",
    "Почесна грамота Вченої ради",
    "Почесна відзнака Вченої ради",
    "почесне звання 'Заслужений викладач КПІ'",
    "почесне звання 'Заслужений професор КПІ'",
    "почесне звання 'Заслужений науковець КПІ'",
    "почесне звання 'Заслужений працівник КПІ'",
    "почесне звання 'Заслужений діяч КПІ'",
    "почесне звання 'Почесний доктор КПІ'",
    "почесна відзнака 'За служіння та відданість КПІ'",
    "почесна відзнака 'За заслуги перед КПІ'"
]

state_awards = [
    "Подяка МОН України",
    "Грамота МОН України",
    "Почесна грамота МОН України",
    "нагрудний знак 'Відмінник освіти'",
    "почесне звання 'Заслужений діяч науки і техніки України'",
    "Подяка КМ України",
    "Грамота КМ України",
]

cl = pymongo.MongoClient("mongodb://localhost:27017/teacher_awards")
db = cl.teacher_awards

i = 0
for el in kpi_awards:
    db.kpi_awards.insert_one({"id": i, "name": el})
    i += 1

i = 0
for el in state_awards:
    db.state_awards.insert_one({"id": i, "name": el})
    i += 1

for el in facs:
    db.facs.insert_one({"name": el})